package com.kalugin1912.dishes

import com.kalugin1912.dishes.data.Dish

object Stubs {
    val dishes: List<Dish> = listOf(
        Dish(
            "5ed8da011f071c00465b2026",
            "Бургер \"Америка\"",
            "320 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, маринованный лук, жареный бекон, сыр чеддер.",
            "https://new-retail.ru/upload/iblock/985/985b0104a9907faa432a0e318885e59a.jpg",
            259
        ),
        Dish(
            "5ed8da011f071c00465b2027",
            "Бургер \"Мексика\"",
            "295 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, мексиканские чипсы начос, лист салата, перчики халапеньо, сыр чеддер, соус сальса из свежих томатов.",
            "https://mesto-burger.burgergroup.ru/content/uploads/2022/12/menju-meksikan.jpg",
            229
        ),
        Dish(
            "5ed8da011f071c00465b2028",
            "Бургер \"Русский\"",
            "460 г • Две котлеты из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, маринованный лук, маринованные огурчики, двойной сыр чеддер, соус ранч.",
            "https://www.unileverfoodsolutions.ru/dam/global-ufs/mcos/russia/calcmenu/recipes/RU-recipes/other/%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9-%D0%B1%D1%83%D1%80%D0%B3%D0%B5%D1%80/main-header.jpg",
            379
        ),
        Dish(
            "5ed8da011f071c00465b2029",
            "Бургер \"Люксембург\"",
            "Куриное филе приготовленное на гриле, картофельная булочка на гриле, сыр чеддер, соус ранч, лист салата, томат, свежий огурец.",
            "https://img.restaurantguru.com/rde7-Luxburgers-burger-2022-09-1.jpg",
            189
        ),
        Dish(
            "5ed8da011f071c00465b202a",
            "Бургер \"Классика\"",
            "290 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, сыр чеддер.",
            "https://grill-bbq.ru/wp-content/uploads/2022/06/burgery-na-grile-5-luchshih-classic.jpg",
            199
        ),
        Dish(
            "5ed8da011f071c00465b202b",
            "Бургер \"Швейцария\"",
            "320 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, натуральный сырный соус, лист салата, томат, маринованный огурчик, 2 ломтика сыра чеддер.",
            "https://bigseventravel.com/wp-content/uploads/2019/06/Screenshot-2019-06-16-at-09.15.26.png",
            279
        ),
        Dish(
            "5ed8da011f071c00465b202e",
            "Пицца Дьябло с двойной начинкой",
            "Бекон, свинина, пепперони, перец болгарский, халапеньо, томатный пицца-соус, соус шрирача, моцарелла, зелень",
            "https://supermegasite.ru/wp-content/uploads/2022/06/luchshie-dostavki-piccy-spb.jpg",
            779
        ),
        Dish(
            "5ed8da011f071c00465b202f",
            "Пицца Карбонара с двойной начинкой",
            "Бекон, пармезан, соус сливочный, моцарелла",
            "https://i.ytimg.com/vi/ZreT0MKYIsM/maxresdefault.jpg",
            739
        ),
        Dish(
            "5ed8da011f071c00465b2030",
            "Пицца Петровская с двойной начинкой",
            "Пепперони, курица, бекон, ветчина, помидоры, шампиньоны, лук красный, моцарелла, укроп",
            "https://irecommend.ru/sites/default/files/product-images/660923/garqqB0MH4kqLFe1343nQ.jpg",
            895
        ),
        Dish(
            "5ed8da011f071c00465b2031",
            "Пицца 2 берега с двойной начинкой",
            "Свинина, курица, пепперони, ветчина, бекон, помидоры, перец болгарский, соус барбекю, моцарелла,укроп",
            "https://korona.by/uploads/content/rj/3v/RJ3V2MDQA3.jpg",
            899
        ),
        Dish(
            "5ed8da011f071c00465b2032",
            "Пицца Мясная с двойной начинкой",
            "Охотничьи колбаски, курица, свинина, пепперони, шампиньоны, томатный пицца-соус, моцарелла, зелень",
            "https://webpulse.imgsmail.ru/imgpreview?mb=webpulse&key=pulse_cabinet-file-22174f6d-2973-4d99-83f3-b798d64523df",
            895
        ),
        Dish(
            "5ed8da011f071c00465b2033",
            "Пицца Маргарита с двойной начинкой",
            "Моцарелла, помидоры, томатный пицца-соус",
            "https://static.tildacdn.com/tild3330-3732-4439-b630-313437643036/DSCF1454.jpg",
            524
        ),
    )
}