package com.kalugin1912.dishes

import com.kalugin1912.dishes.data.Dish

object Stubs {
    val dishes: List<Dish> = listOf(
        Dish(
            "5ed8da011f071c00465b2026",
            "Бургер \"Америка\"",
            "320 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, маринованный лук, жареный бекон, сыр чеддер.",
            "https://static.tildacdn.com/tild6235-6531-4738-b336-643362376561/photo.jpg",
            259
        ),
        Dish(
            "5ed8da011f071c00465b2027",
            "Бургер \"Мексика\"",
            "295 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, мексиканские чипсы начос, лист салата, перчики халапеньо, сыр чеддер, соус сальса из свежих томатов.",
            "https://thumb.tildacdn.com/tild3935-6239-4034-b033-616533333039/-/resize/600x400/-/format/webp/photo.jpg",
            229
        ),
        Dish(
            "5ed8da011f071c00465b2028",
            "Бургер \"Русский\"",
            "460 г • Две котлеты из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, маринованный лук, маринованные огурчики, двойной сыр чеддер, соус ранч.",
            "https://static.tildacdn.com/tild6230-3838-4431-b436-366137646361/_.jpeg",
            379
        ),
        Dish(
            "5ed8da011f071c00465b2029",
            "Бургер \"Люксембург\"",
            "Куриное филе приготовленное на гриле, картофельная булочка на гриле, сыр чеддер, соус ранч, лист салата, томат, свежий огурец.",
            "https://static.tildacdn.com/tild6366-6664-4338-b239-393931646134/photo.jpeg",
            189
        ),
        Dish(
            "5ed8da011f071c00465b202a",
            "Бургер \"Классика\"",
            "290 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, фирменный соус, лист салата, томат, сыр чеддер.",
            "https://static.tildacdn.com/tild6564-3739-4536-a363-333236303437/FARSH2607202211954.jpeg",
            199
        ),
        Dish(
            "5ed8da011f071c00465b202b",
            "Бургер \"Швейцария\"",
            "320 г • Котлета из 100% говядины (прожарка medium) на гриле, картофельная булочка на гриле, натуральный сырный соус, лист салата, томат, маринованный огурчик, 2 ломтика сыра чеддер.",
            "https://static.tildacdn.com/stor6436-6639-4665-a531-303337616634/51463382.jpg",
            279
        ),
        Dish(
            "5ed8da011f071c00465b202e",
            "Пицца Дьябло с двойной начинкой",
            "Бекон, свинина, пепперони, перец болгарский, халапеньо, томатный пицца-соус, соус шрирача, моцарелла, зелень",
            "https://yan-pizza.ru/wp-content/uploads/2020/08/pochemu-nasha-piczcza-luchshaya.jpg",
            779
        ),
        Dish(
            "5ed8da011f071c00465b202f",
            "Пицца Карбонара с двойной начинкой",
            "Бекон, пармезан, соус сливочный, моцарелла",
            "https://e0.edimdoma.ru/data/posts/0002/1429/21429-ed4_wide.jpg?1631194036",
            739
        ),
        Dish(
            "5ed8da011f071c00465b2030",
            "Пицца Петровская с двойной начинкой",
            "Пепперони, курица, бекон, ветчина, помидоры, шампиньоны, лук красный, моцарелла, укроп",
            "https://fotorecept.ru/wp-content/uploads/2013/08/brokkoli_pizza_05.jpg",
            895
        ),
        Dish(
            "5ed8da011f071c00465b2031",
            "Пицца 2 берега с двойной начинкой",
            "Свинина, курица, пепперони, ветчина, бекон, помидоры, перец болгарский, соус барбекю, моцарелла,укроп",
            "https://kartinkin.net/uploads/posts/2022-08/1660905824_1-kartinkin-net-p-pitstsa-krasivaya-vkontakte-2.jpg",
            899
        ),
        Dish(
            "5ed8da011f071c00465b2032",
            "Пицца Мясная с двойной начинкой",
            "Охотничьи колбаски, курица, свинина, пепперони, шампиньоны, томатный пицца-соус, моцарелла, зелень",
            "https://lh5.googleusercontent.com/heMT6Ee7CX8GMkqW130-qZSdd5-fwy3gNtRJhQlKDi6qb4F4ymFrIhidAWqq41HYLlGlHuyJsXzSmGrD37OhcG7acS8Oo5rr09RfgAIED8axe4fYjVFMGFLEbIWDUK-dYX9un7bM",
            895
        ),
        Dish(
            "5ed8da011f071c00465b2033",
            "Пицца Маргарита с двойной начинкой",
            "Моцарелла, помидоры, томатный пицца-соус",
            "https://www.edimdoma.ru/system/images/contents/0001/3577/wide/87874-original.jpg?1628279359",
            524
        ),
    )
}